app/controllers/api/flights_controller.rb

  def create

    @flight = Flight.create(flight_params)
---
INSERT INTO "flights" ("date", "planeNumber", "flightTime", "destination", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2018-12-02 00:00:00"], ["planeNumber", "5165r"], ["flightTime", "4"], ["destination", "beach"], ["created_at", "2018-02-07 12:08:24.039416"], ["updated_at", "2018-02-07 12:08:24.039416"]]

  def update
    # binding.pry
    set_flight

      @flight.update(flight_params)
---
UPDATE "flights" SET "date" = ?, "pilot" = ?, "flightTime" = ?, "planeNumber" = ?, "destination" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["date", nil], ["pilot", "andrew ramell"], ["flightTime", "new flight"], ["planeNumber", "fdafd"], ["destination", "fdafdf"], ["updated_at", "2018-02-08 03:15:11.450743"], ["id", 2]]

  def destroy
    set_flight
    @flight.delete
---
DELETE FROM "flights" WHERE "flights"."id" = ?  [["id", 5]]

  def set_flight
    @flight = Flight.find_by(:id => params[:id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]